driver-tests/bpelse/assign/VariablePropertyTest/BooleanCopyJBI/src/jbiServiceUnits/BooleanCopy/IntToBoolean.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="IntToBoolean" targetNamespace="http://j2ee.netbeans.org/wsdl/VariableProperty1Bpel/IntToBoolean"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/VariableProperty1Bpel/IntToBoolean" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:vprop="http://docs.oasis-open.org/wsbpel/2.0/varprop">
    <types/>
    <message name="IntToBooleanOperationRequest">
        <part name="part1" type="xsd:int"/>
    </message>
    <message name="IntToBooleanOperationResponse">
        <part name="part1" type="xsd:string"/>
    </message>
    <portType name="IntToBooleanPortType">
        <operation name="IntToBooleanOperation">
            <input name="input1" message="tns:IntToBooleanOperationRequest"/>
            <output name="output1" message="tns:IntToBooleanOperationResponse"/>
        </operation>
    </portType>
    <binding name="IntToBooleanBinding" type="tns:IntToBooleanPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="IntToBooleanOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/VariableProperty1Bpel/IntToBoolean"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/VariableProperty1Bpel/IntToBoolean"/>
            </output>
        </operation>
    </binding>
    <service name="IntToBooleanService">
        <port name="IntToBooleanPort" binding="tns:IntToBooleanBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/IntToBooleanService/IntToBooleanPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="IntToBoolean">
        <plnk:role name="IntToBooleanPortTypeRole" portType="tns:IntToBooleanPortType"/>
    </plnk:partnerLinkType>
    <vprop:property name="intProp" type="xsd:int"/>
    <vprop:propertyAlias propertyName="tns:intProp" messageType="tns:IntToBooleanOperationRequest" part="part1"/>
</definitions>
