driver-tests/bpelse/assign/VariablePropertyTest/BooleanCopyJBI/test/IntToBoolean/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://j2ee.netbeans.org/wsdl/VariableProperty1Bpel/IntToBoolean">
  <soapenv:Body>
    <int:IntToBooleanOperation>
      <part1>4</part1>
    </int:IntToBooleanOperation>
  </soapenv:Body>
</soapenv:Envelope>